pbs_maui.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-04-14 Sun 23:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>PBS and Maui</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">PBS and Maui</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orged78d00">Introduction</a></li>
<li><a href="#org7311c72">Installation</a></li>
<li><a href="#orga174024">Configuration</a>
<ul>
<li><a href="#org256afc2">Server (head node)</a>
<ul>
<li><a href="#orgc0465bf"><code>/var/spoo/torque/server_priv/nodes</code></a></li>
<li><a href="#org68ac316">PBS/Torque server</a></li>
<li><a href="#orgdc8ad1f">Maui</a></li>
</ul>
</li>
<li><a href="#org30f594d">Client (computing node)</a>
<ul>
<li><a href="#org11aeed6"><code>/var/spool/torque/server_name</code></a></li>
<li><a href="#orgeca5e0c"><code>/var/spool/torque/mom_priv/config</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgab4eaaa">Configure the service</a>
<ul>
<li><a href="#org5610b84">Server (head node)</a>
<ul>
<li><a href="#org941ce0a">Resource manager (PBS/Torque server)</a></li>
<li><a href="#org07779a2">Scheduler</a>
<ul>
<li><a href="#org3650624">Maui</a></li>
<li><a href="#org4c1ed88">PBS scheduler</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgce3ee45">Client (computing node)</a>
<ul>
<li><a href="#org0b9f541">PBS client</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0d93b8a">Start and enable the service</a>
<ul>
<li><a href="#org32319a0">Server (head node)</a></li>
<li><a href="#org30539ad">Client (computing node)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orged78d00" class="outline-2">
<h2 id="orged78d00">Introduction</h2>
<div class="outline-text-2" id="text-orged78d00">
<p>
Portable batch system (PBS) was originally developed by NASA, which is comprised of a <i>resource manager</i>, a <i>scheduler</i> and a <i>client</i>. What is different, a resource manager and a scheduler are usually running on server side, while clients running on computing nodes. For the softwares, both commercial <i>PBS Pro</i> and open-source <i>Torque</i> are available. But herein, we consider the open-source Torque only.
</p>

<p>
Just as their names indicate, a resource manager targets for resource management and configuration, responsible for checking the availability of resource, e.g. CPU, memory, etc., and resource assignment; a scheduler accept jobs from subscribers and maintains one or more queues.
</p>

<p>
The built-in scheduler is a simple FIFO scheduler. However, other schedulers can be adopted instead. For instance, <i>Maui</i> is a very popular and powerful scheduler, based on which advanced and complex strategies can be realized and customized.
</p>
</div>
</div>
<div id="outline-container-org7311c72" class="outline-2">
<h2 id="org7311c72">Installation</h2>
<div class="outline-text-2" id="text-org7311c72">
<p>
For <a href="https://wiki.archlinux.org">ArchLinux</a>, Torque and Maui can be easily installed from <i>AUR</i>.
</p>
<div class="org-src-container">
<pre class="src src-sh">yaourt torque
...
yaourt maui
...
</pre>
</div>
</div>
</div>
<div id="outline-container-orga174024" class="outline-2">
<h2 id="orga174024">Configuration</h2>
<div class="outline-text-2" id="text-orga174024">
</div>
<div id="outline-container-org256afc2" class="outline-3">
<h3 id="org256afc2">Server (head node)</h3>
<div class="outline-text-3" id="text-org256afc2">
</div>
<div id="outline-container-orgc0465bf" class="outline-4">
<h4 id="orgc0465bf"><code>/var/spoo/torque/server_priv/nodes</code></h4>
<div class="outline-text-4" id="text-orgc0465bf">
<div class="org-src-container">
<pre class="src src-sh">node1 <span style="color: #fcaf3e;">np</span>=2
node2 <span style="color: #fcaf3e;">np</span>=4
...
</pre>
</div>
</div>
</div>
<div id="outline-container-org68ac316" class="outline-4">
<h4 id="org68ac316">PBS/Torque server</h4>
<div class="outline-text-4" id="text-org68ac316">
<div class="org-src-container">
<pre class="src src-sh">qmgr -c <span style="color: #e9b96e;">'p s'</span>
<span style="color: #73d216;">#</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">Create queues and set their attributes.</span>
<span style="color: #73d216;">#</span>
<span style="color: #73d216;">#</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">Create and define queue COMMON</span>
<span style="color: #73d216;">#</span>
create queue COMMON
<span style="color: #e090d7;">set</span> queue COMMON queue_type = Execution
<span style="color: #e090d7;">set</span> queue COMMON resources_default.nodes = 1
<span style="color: #e090d7;">set</span> queue COMMON resources_default.walltime = 240:00:00
<span style="color: #e090d7;">set</span> queue COMMON enabled = True
<span style="color: #e090d7;">set</span> queue COMMON started = True
<span style="color: #73d216;">#</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">Create and define queue VIP</span>
<span style="color: #73d216;">#</span>
create queue VIP
<span style="color: #e090d7;">set</span> queue VIP queue_type = Execution
<span style="color: #e090d7;">set</span> queue VIP resources_default.nodes = 1
<span style="color: #e090d7;">set</span> queue VIP resources_default.walltime = 240:00:00
<span style="color: #e090d7;">set</span> queue VIP enabled = True
<span style="color: #e090d7;">set</span> queue VIP started = True
<span style="color: #73d216;">#</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">Set server attributes.</span>
<span style="color: #73d216;">#</span>
<span style="color: #e090d7;">set</span> server scheduling = True
<span style="color: #e090d7;">set</span> server acl_hosts = head
<span style="color: #e090d7;">set</span> server default_queue = COMMON
<span style="color: #e090d7;">set</span> server log_events = 511
<span style="color: #e090d7;">set</span> server mail_from = server
<span style="color: #e090d7;">set</span> server query_other_jobs = True
<span style="color: #e090d7;">set</span> server scheduler_iteration = 600
<span style="color: #e090d7;">set</span> server node_check_rate = 150
<span style="color: #e090d7;">set</span> server tcp_timeout = 300
<span style="color: #e090d7;">set</span> server job_stat_rate = 45
<span style="color: #e090d7;">set</span> server poll_jobs = True
<span style="color: #e090d7;">set</span> server mom_job_sync = True
<span style="color: #e090d7;">set</span> server mail_domain = example.com
<span style="color: #e090d7;">set</span> server keep_completed = 0
<span style="color: #e090d7;">set</span> server next_job_number = 1
<span style="color: #e090d7;">set</span> server moab_array_compatible = True
<span style="color: #e090d7;">set</span> server nppcu = 1
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc8ad1f" class="outline-4">
<h4 id="orgdc8ad1f">Maui</h4>
<div class="outline-text-4" id="text-orgdc8ad1f">
<p>
Append following lines to <code>maui.cfg</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh">CLASSWEIGHT   1
CLASSCFG[COMMON]   <span style="color: #fcaf3e;">PRIORITY</span>=1
CLASSCFG[VIP]   <span style="color: #fcaf3e;">PRIORITY</span>=100000
CLASSLIST   [COMMON VIP]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org30f594d" class="outline-3">
<h3 id="org30f594d">Client (computing node)</h3>
<div class="outline-text-3" id="text-org30f594d">
</div>
<div id="outline-container-org11aeed6" class="outline-4">
<h4 id="org11aeed6"><code>/var/spool/torque/server_name</code></h4>
<div class="outline-text-4" id="text-org11aeed6">
<div class="org-src-container">
<pre class="src src-sh">head
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeca5e0c" class="outline-4">
<h4 id="orgeca5e0c"><code>/var/spool/torque/mom_priv/config</code></h4>
<div class="outline-text-4" id="text-orgeca5e0c">
<div class="org-src-container">
<pre class="src src-sh">$<span style="color: #fcaf3e;">pbssever</span> head
$<span style="color: #fcaf3e;">logevent</span> 255
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgab4eaaa" class="outline-2">
<h2 id="orgab4eaaa">Configure the service</h2>
<div class="outline-text-2" id="text-orgab4eaaa">
</div>
<div id="outline-container-org5610b84" class="outline-3">
<h3 id="org5610b84">Server (head node)</h3>
<div class="outline-text-3" id="text-org5610b84">
</div>
<div id="outline-container-org941ce0a" class="outline-4">
<h4 id="org941ce0a">Resource manager (PBS/Torque server)</h4>
<div class="outline-text-4" id="text-org941ce0a">
<p>
Create <code>/etc/systemd/system/torque-server.service</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">[Unit]
<span style="color: #fcaf3e;">Description</span>=TORQUE server
<span style="color: #fcaf3e;">Wants</span>=basic.target
<span style="color: #fcaf3e;">After</span>=basic.target network.target

[Service]
<span style="color: #fcaf3e;">Type</span>=forking
<span style="color: #fcaf3e;">PIDFile</span>=/var/spool/torque/server_priv/server.lock
<span style="color: #fcaf3e;">ExecStart</span>=/usr/local/sbin/pbs_server

[Install]
<span style="color: #fcaf3e;">WantedBy</span>=multi-user.target
</pre>
</div>
</div>
</div>
<div id="outline-container-org07779a2" class="outline-4">
<h4 id="org07779a2">Scheduler<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h4>
<div class="outline-text-4" id="text-org07779a2">
</div>
<div id="outline-container-org3650624" class="outline-5">
<h5 id="org3650624">Maui</h5>
<div class="outline-text-5" id="text-org3650624">
<p>
Create <code>/etc/systemd/system/torque-maui.service</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">[Unit]
<span style="color: #fcaf3e;">Description</span>=Maui scheduler
<span style="color: #fcaf3e;">Wants</span>=torque-server.service
<span style="color: #fcaf3e;">After</span>=torque-server.service

[Service]
<span style="color: #fcaf3e;">Type</span>=forking
<span style="color: #fcaf3e;">PIDFile</span>=/usr/local/maui/maui.pid
<span style="color: #fcaf3e;">ExecStart</span>=/usr/local/maui/sbin/maui

[Install]
<span style="color: #fcaf3e;">WantedBy</span>=multi-user.target
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c1ed88" class="outline-5">
<h5 id="org4c1ed88">PBS scheduler</h5>
<div class="outline-text-5" id="text-org4c1ed88">
<p>
Create <code>/etc/systemd/system/torque-scheduler.service</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">[Unit]
<span style="color: #fcaf3e;">Description</span>=TORQUE scheduler
<span style="color: #fcaf3e;">Wants</span>=torque-server.service
<span style="color: #fcaf3e;">After</span>=torque-server.service

[Service]
<span style="color: #fcaf3e;">Type</span>=forking
<span style="color: #fcaf3e;">PIDFile</span>=/var/spool/torque/sched_priv/sched.lock
<span style="color: #fcaf3e;">ExecStart</span>=/usr/local/sbin/pbs_sched

[Install]
<span style="color: #fcaf3e;">WantedBy</span>=multi-user.target
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgce3ee45" class="outline-3">
<h3 id="orgce3ee45">Client (computing node)</h3>
<div class="outline-text-3" id="text-orgce3ee45">
</div>
<div id="outline-container-org0b9f541" class="outline-4">
<h4 id="org0b9f541">PBS client</h4>
<div class="outline-text-4" id="text-org0b9f541">
<p>
Create <code>/etc/systemd/system/torque-node.service</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">[Unit]
<span style="color: #fcaf3e;">Description</span>=TORQUE node
<span style="color: #fcaf3e;">Wants</span>=basic.target
<span style="color: #fcaf3e;">After</span>=basic.target network.target

[Service]
<span style="color: #fcaf3e;">Type</span>=forking
<span style="color: #fcaf3e;">PIDFile</span>=/var/spool/torque/mom_priv/mom.lock
<span style="color: #fcaf3e;">ExecStart</span>=/usr/local/sbin/pbs_mom

[Install]
<span style="color: #fcaf3e;">WantedBy</span>=multi-user.target
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org0d93b8a" class="outline-2">
<h2 id="org0d93b8a">Start and enable the service</h2>
<div class="outline-text-2" id="text-org0d93b8a">
</div>
<div id="outline-container-org32319a0" class="outline-3">
<h3 id="org32319a0">Server (head node)</h3>
<div class="outline-text-3" id="text-org32319a0">
<div class="org-src-container">
<pre class="src src-sh">systemctl enable torque-server.service
systemctl start torque-server.service
systemctl enable torque-maui.service
systemctl start torque-maui.service
</pre>
</div>
</div>
</div>
<div id="outline-container-org30539ad" class="outline-3">
<h3 id="org30539ad">Client (computing node)</h3>
<div class="outline-text-3" id="text-org30539ad">
<div class="org-src-container">
<pre class="src src-sh">systemctl enable torque-node.service
systemctl start torque-node.service
</pre>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Only one scheduler is needed, which can be Maui scheduler or built-in PBS scheduler.
</p></div></div>


</div>
</div></div>
</body>
</html>
